LDA 2050h	;Load στον Α το περιεχόμενο της μνήμης 2050h (τα δύο πρώτα ψύφία του 16αδικού αριθμού)
MOV B,A		;αποθήκευση το περιεχόμενο του Α στον Β
LDA 2052h	;Load στον Α το περιεχόμενο της μνήμης 2052h (τα δύο τελευταία ψύφία του 16αδικού αριθμού)
RLC		;ολίσθηση 1/4 (Γίνεται ολίσθηση 4 φορές ώστε να γίνει αντιμετάθεση του αριθμού)
RLC		;ολίσθηση 2/4 (Γίνεται ολίσθηση 4 φορές ώστε να γίνει αντιμετάθεση του αριθμού)
RLC		;ολίσθηση 3/4 (Γίνεται ολίσθηση 4 φορές ώστε να γίνει αντιμετάθεση του αριθμού)
RLC		;ολίσθηση 4/4 (Γίνεται ολίσθηση 4 φορές ώστε να γίνει αντιμετάθεση του αριθμού)
CMP B		;Σύγκριση ψηφίων μεταξύ θέσης μνήμης τα δύο πρώτα με τα δύο τελευταία
JNZ LFS		;Jump στο LFS αν δεν είναι όμοια. LFS για LevelFailSucceed
LDA 2051h	;Load στον Α το περιεχόμενο της μνήμης 2051h (τα δύο μεσσαία ψύφία του 16αδικού αριθμού)
MOV B,A		;αποθήκευση το περιεχόμενο του Α στον Β
RLC		;ολίσθηση 1/4 (Γίνεται ολίσθηση 4 φορές ώστε να γίνει αντιμετάθεση του αριθμού)
RLC		;ολίσθηση 2/4 (Γίνεται ολίσθηση 4 φορές ώστε να γίνει αντιμετάθεση του αριθμού)
RLC		;ολίσθηση 3/4 (Γίνεται ολίσθηση 4 φορές ώστε να γίνει αντιμετάθεση του αριθμού)
RLC		;ολίσθηση 4/4 (Γίνεται ολίσθηση 4 φορές ώστε να γίνει αντιμετάθεση του αριθμού)
CMP B		;Σύγκριση ψηφίων μεταξύ θέσης μνήμης τα δύο πρώτα με τα δύο τελευταία
JNZ LFS		;Jump στο LFS αν δεν είναι όμοια. LFS για LevelFailSucceed
MVI A,01h	;Load στον Α την τιμή 01
STA 3050h	;αποθήκευση το περιεχόμενο του Α στη θέση μνήμης 3050h
JMP LS1		;Jump στο LS1 γιατερματισμό. LS για LevelSucceed
LFS: MVI A,0FFh	;Load στον Α την τιμή FF
STA 3050h	;αποθήκευση το περιεχόμενο του Α στη θέση μνήμης 3050h
LS1: hlt	;Τερματισμός προγράμματος